
[
    {
      "title": "West Indies make wholesale changes for Australia Tests",
      "author": "nithesh0827@gmail.com",
      "content": "Cricket West Indies have made wholesale changes to their Test squad for the upcoming two-match Test series in Australia. As many as seven uncapped players have been picked in the 15-man squad with the likes of Jason Holder and Kyle Mayers making themselves unavailable.From the squad that played against India earlier this year at home, the likes of Jermaine Blackwood, Raymon Reifer, Rahkeem Cornwall, Shannon Gabriel and Jomel Warrican have been left out. The board also noted that Jayden Seales was unavailable for selection due to a shoulder injury.Uncapped allrounder Kevin Sinclair, who was picked for the India series but didn't get a game, has been retained. Apart from him, the other uncapped players picked in the squad are batter Zachary McCaskie, wicket-keeper Tevin Imlach, allrounders Justin Greaves and Kavem Hodge, fast bowlers Akeem Jordan and Shamar Joseph. Gudakesh Motie, whose last Test appearance was against South Africa in March, has been recalled. Holder and Mayers will be looking to pursue T20 deals in January, according to CWI.'The squad has been affected by the unavailability of some key players,' Desmond Haynes, CWI Lead Selector, said. 'However, we have had a very strong red-ball program being run over the past year, which has unearthed significant talent throughout the region. The selected players have passed each test given to them and must now be given the opportunity to showcase their skills in the test arena. Australia away is always a challenge, but we are confident in our team.' Fast bowler Alzarri Joseph has been appointed as the new vice-captain. West Indies will play a four-day warm-up fixture before taking on Australia in the first Test in Adelaide, beginning on January 17. The second Test will be a pink-ball affair, set to commence on January 25 at the Gabba."
    },
    {
      "title": "David Houghton steps down as Zimbabwe men's coach",
      "author": "kanishkar0213@gmail.com",
      "content": "Zimbabwe Cricket (ZC) have confirmed that their senior men's head coach Dave Houghton has resigned from his position with immediate effect. The board revealed that it plans to keep Houghton involved and is looking 'to re-assign him to a new role within the organisation'.An interim technical team, which will be announced in due course according to ZC, will be in charge of the team during the tour to Sri Lanka in January.Zimbabwe recently failed to qualify for the T20 World Cup, where they lost to Namibia and Uganda, but the last nail in the coffin was their loss to Ireland in both the ODI and T20I series.In his resignation letter, ZC revealed, Houghton mentioned that had 'lost the changeroom' after 18 months in charge and felt that a 'new voice' was needed to take the team forward.'I have always had Zimbabwe cricket at heart and, though my coaching of the national team comes to an end, I would love to be involved in other areas,' Houghton said after tending his resignation. 'The talent base in Zimbabwe is enormous. How we move players from talented to performing well on the international stage is a great project to be involved in.'"
    }
    
  ]
  